[Killed] ArrayDeclaration
src/DeployFrequency.ts:9:19
 const ONE_DAY = 1000 * 60 * 60 * 24
 
 export class DeployFrequency {
-  log: string[] = []
+  log: string[] = ["Stryker was here"]
   today: Date = new Date()
   rList: Release[] = new Array<Release>()
killedBy: Deploy frequency should get an empty log of releases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/DeployFrequency.ts:17:77
     return this.log
   }
 
-  constructor(releases: Release[] | null, dateString: string | null = null) {
-    this.rList = releases as Release[]
-    if (this.rList === null || this.rList.length === 0) {
-      throw new Error('Empty release list')
-    }
-
-    if (dateString !== null) {
-      this.today = new Date(dateString)
-    }
-  }
+  constructor(releases: Release[] | null, dateString: string | null = null) {}
 
   weekly(): number {
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/DeployFrequency.ts:19:57
 
   constructor(releases: Release[] | null, dateString: string | null = null) {
     this.rList = releases as Release[]
-    if (this.rList === null || this.rList.length === 0) {
-      throw new Error('Empty release list')
-    }
+    if (this.rList === null || this.rList.length === 0) {}
 
     if (dateString !== null) {
killedBy: Deploy frequency should throw exception when no releases
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Empty release list"

Received function did not throw

[Killed] EqualityOperator
src/DeployFrequency.ts:19:32
 
   constructor(releases: Release[] | null, dateString: string | null = null) {
     this.rList = releases as Release[]
-    if (this.rList === null || this.rList.length === 0) {
+    if (this.rList === null || this.rList.length !== 0) {
       throw new Error('Empty release list')
     }
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: Empty release list

[Killed] BlockStatement
src/DeployFrequency.ts:23:30
       throw new Error('Empty release list')
     }
 
-    if (dateString !== null) {
-      this.today = new Date(dateString)
-    }
+    if (dateString !== null) {}
   }
 
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/DeployFrequency.ts:30:39
 
   weekly(): number {
     let releaseCount = 0
-    for (const release of this.rList) {
-      const relDate = new Date(release.published_at)
-      if (this.days_between(this.today, relDate) < 8) {
-        this.log.push(`release->  ${release.name}:${release.published_at}`)
-        releaseCount++
-      }
-    }
+    for (const release of this.rList) {}
 
     return releaseCount
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/DeployFrequency.ts:32:11
     let releaseCount = 0
     for (const release of this.rList) {
       const relDate = new Date(release.published_at)
-      if (this.days_between(this.today, relDate) < 8) {
+      if (true) {
         this.log.push(`release->  ${release.name}:${release.published_at}`)
         releaseCount++
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/DeployFrequency.ts:32:11
     let releaseCount = 0
     for (const release of this.rList) {
       const relDate = new Date(release.published_at)
-      if (this.days_between(this.today, relDate) < 8) {
+      if (false) {
         this.log.push(`release->  ${release.name}:${release.published_at}`)
         releaseCount++
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] StringLiteral
src/DeployFrequency.ts:33:23
     for (const release of this.rList) {
       const relDate = new Date(release.published_at)
       if (this.days_between(this.today, relDate) < 8) {
-        this.log.push(`release->  ${release.name}:${release.published_at}`)
+        this.log.push(``)
         releaseCount++
       }
killedBy: Deploy frequency should get release log list weekly when rate calculated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "release->  v0.1.0:2023-04-29T06:18:36Z"
Received: undefined

[Killed] UpdateOperator
src/DeployFrequency.ts:34:9
       const relDate = new Date(release.published_at)
       if (this.days_between(this.today, relDate) < 8) {
         this.log.push(`release->  ${release.name}:${release.published_at}`)
-        releaseCount++
+        releaseCount--
       }
     }
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/DeployFrequency.ts:43:39
 
   monthly(): number {
     let releaseCount = 0
-    for (const release of this.rList) {
-      const relDate = new Date(release.published_at)
-      if (this.days_between(this.today, relDate) < 31) {
-        this.log.push(`release->  ${release.name}:${release.published_at}`)
-        releaseCount++
-      }
-    }
+    for (const release of this.rList) {}
 
     return releaseCount
killedBy: Deploy frequency should monthly calculate releases pr week for release more than 1 week ago
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/DeployFrequency.ts:45:11
     let releaseCount = 0
     for (const release of this.rList) {
       const relDate = new Date(release.published_at)
-      if (this.days_between(this.today, relDate) < 31) {
+      if (false) {
         this.log.push(`release->  ${release.name}:${release.published_at}`)
         releaseCount++
killedBy: Deploy frequency should monthly calculate releases pr week for release more than 1 week ago
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/DeployFrequency.ts:45:11
     let releaseCount = 0
     for (const release of this.rList) {
       const relDate = new Date(release.published_at)
-      if (this.days_between(this.today, relDate) < 31) {
+      if (true) {
         this.log.push(`release->  ${release.name}:${release.published_at}`)
         releaseCount++
killedBy: Deploy frequency should calculate release rate last month based on 7 releases list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.40"
Received: "1.63"

[Killed] ArithmeticOperator
src/DeployFrequency.ts:55:24
   }
 
   rate(): string {
-    return (Math.round(this.monthly() * 700) / 3000).toFixed(2)
+    return (Math.round(this.monthly() / 700) / 3000).toFixed(2)
   }
 
killedBy: Deploy frequency should calculate release rate last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.47"
Received: "0.00"

[Killed] ArithmeticOperator
src/DeployFrequency.ts:55:13
   }
 
   rate(): string {
-    return (Math.round(this.monthly() * 700) / 3000).toFixed(2)
+    return (Math.round(this.monthly() * 700) * 3000).toFixed(2)
   }
 
killedBy: Deploy frequency should calculate release rate last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.47"
Received: "4200000.00"

[Killed] ArithmeticOperator
src/DeployFrequency.ts:60:35
 
   private days_between(date1: Date, date2: Date): number {
     // Calculate the difference in milliseconds
-    const differenceMs = Math.abs(date1.valueOf() - date2.valueOf())
+    const differenceMs = Math.abs(date1.valueOf() + date2.valueOf())
 
     // Convert back to days and return
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
src/DeployFrequency.ts:63:23
     const differenceMs = Math.abs(date1.valueOf() - date2.valueOf())
 
     // Convert back to days and return
-    return Math.round(differenceMs / ONE_DAY)
+    return Math.round(differenceMs * ONE_DAY)
   }
 }
killedBy: Deploy frequency should calculate releases pr week for release less than 1 week
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
