[Killed] MethodExpression
src/LeadTime.ts:31:18
       this.today = today
     }
 
-    this.pulls = pulls.filter(
-      p => +new Date(p.merged_at) > this.today.valueOf() - 31 * ONE_DAY
-    )
+    this.pulls = pulls
     this.releases = releases.map(r => {
       return {
killedBy: LeadTime should return 0 on too old pull-requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 8

[Killed] EqualityOperator
src/LeadTime.ts:32:12
     }
 
     this.pulls = pulls.filter(
-      p => +new Date(p.merged_at) > this.today.valueOf() - 31 * ONE_DAY
+      p => +new Date(p.merged_at) >= this.today.valueOf() - 31 * ONE_DAY
     )
     this.releases = releases.map(r => {
killedBy: LeadTime should get event log list when lead time calculated and filtered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/LeadTime.ts:32:12
     }
 
     this.pulls = pulls.filter(
-      p => +new Date(p.merged_at) > this.today.valueOf() - 31 * ONE_DAY
+      p => true
     )
     this.releases = releases.map(r => {
killedBy: LeadTime should return 0 on too old pull-requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 8

[Killed] UnaryOperator
src/LeadTime.ts:36:20
     )
     this.releases = releases.map(r => {
       return {
-        published: +new Date(r.published_at),
+        published: -new Date(r.published_at),
         url: r.url,
         name: r.name,
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] BooleanLiteral
src/LeadTime.ts:48:32
   getLog(): string[] {
     return this.log
   }
-  async getLeadTime(filtered = false): Promise<number> {
+  async getLeadTime(filtered = true): Promise<number> {
     if (this.pulls.length === 0 || this.releases.length === 0) {
       return 0
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Killed] EqualityOperator
src/LeadTime.ts:49:36
     return this.log
   }
   async getLeadTime(filtered = false): Promise<number> {
-    if (this.pulls.length === 0 || this.releases.length === 0) {
+    if (this.pulls.length === 0 || this.releases.length !== 0) {
       return 0
     }
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] ConditionalExpression
src/LeadTime.ts:49:9
     return this.log
   }
   async getLeadTime(filtered = false): Promise<number> {
-    if (this.pulls.length === 0 || this.releases.length === 0) {
+    if (true) {
       return 0
     }
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Survived] ConditionalExpression
src/LeadTime.ts:53:9
       return 0
     }
 
-    if (filtered) {
+    if (true) {
       this.log.push('\nLog is filtered - only feat and fix.')
     }

[Survived] ConditionalExpression
src/LeadTime.ts:53:9
       return 0
     }
 
-    if (filtered) {
+    if (false) {
       this.log.push('\nLog is filtered - only feat and fix.')
     }

[Killed] ConditionalExpression
src/LeadTime.ts:60:9
     const leadTimes: number[] = []
     for (const pull of this.pulls) {
       if (
-        typeof pull.merged_at === 'string' &&
-        pull.merged_at &&
-        typeof pull.base.repo.name === 'string' &&
-        pull.base.repo.name &&
-        pull.base.ref === 'main'
+        false
       ) {
         if (
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] EqualityOperator
src/LeadTime.ts:60:9
     const leadTimes: number[] = []
     for (const pull of this.pulls) {
       if (
-        typeof pull.merged_at === 'string' &&
+        typeof pull.merged_at !== 'string' &&
         pull.merged_at &&
         typeof pull.base.repo.name === 'string' &&
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] EqualityOperator
src/LeadTime.ts:62:9
       if (
         typeof pull.merged_at === 'string' &&
         pull.merged_at &&
-        typeof pull.base.repo.name === 'string' &&
+        typeof pull.base.repo.name !== 'string' &&
         pull.base.repo.name &&
         pull.base.ref === 'main'
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Survived] ConditionalExpression
src/LeadTime.ts:62:9
       if (
         typeof pull.merged_at === 'string' &&
         pull.merged_at &&
-        typeof pull.base.repo.name === 'string' &&
+        true &&
         pull.base.repo.name &&
         pull.base.ref === 'main'

[Killed] EqualityOperator
src/LeadTime.ts:64:9
         pull.merged_at &&
         typeof pull.base.repo.name === 'string' &&
         pull.base.repo.name &&
-        pull.base.ref === 'main'
+        pull.base.ref !== 'main'
       ) {
         if (
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Survived] ConditionalExpression
src/LeadTime.ts:64:9
         pull.merged_at &&
         typeof pull.base.repo.name === 'string' &&
         pull.base.repo.name &&
-        pull.base.ref === 'main'
+        true
       ) {
         if (

[Killed] ConditionalExpression
src/LeadTime.ts:67:11
         pull.base.ref === 'main'
       ) {
         if (
-          filtered &&
-          !(pull.title.startsWith('feat') || pull.title.startsWith('fix'))
+          true
         ) {
           continue
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] LogicalOperator
src/LeadTime.ts:67:11
         pull.base.ref === 'main'
       ) {
         if (
-          filtered &&
-          !(pull.title.startsWith('feat') || pull.title.startsWith('fix'))
+          filtered || !(pull.title.startsWith('feat') || pull.title.startsWith('fix'))
         ) {
           continue
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
src/LeadTime.ts:68:13
       ) {
         if (
           filtered &&
-          !(pull.title.startsWith('feat') || pull.title.startsWith('fix'))
+          !(true)
         ) {
           continue
killedBy: LeadTime should get event log list when lead time calculated and filtered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] LogicalOperator
src/LeadTime.ts:68:13
       ) {
         if (
           filtered &&
-          !(pull.title.startsWith('feat') || pull.title.startsWith('fix'))
+          !(pull.title.startsWith('feat') && pull.title.startsWith('fix'))
         ) {
           continue
killedBy: LeadTime should get event log list when lead time calculated and filtered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/LeadTime.ts:69:11
         if (
           filtered &&
           !(pull.title.startsWith('feat') || pull.title.startsWith('fix'))
-        ) {
-          continue
-        }
+        ) {}
 
         const mergeTime = +new Date(pull.merged_at)
killedBy: LeadTime should get event log list when lead time calculated and filtered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] UnaryOperator
src/LeadTime.ts:73:27
           continue
         }
 
-        const mergeTime = +new Date(pull.merged_at)
+        const mergeTime = -new Date(pull.merged_at)
         const laterReleases = this.releases.filter(
           r => r.published > mergeTime && r.url.includes(pull.base.repo.name)
killedBy: LeadTime should return 8.5 on two pull-requests with two commits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8.5
Received: 7.5

[Killed] MethodExpression
src/LeadTime.ts:74:31
         }
 
         const mergeTime = +new Date(pull.merged_at)
-        const laterReleases = this.releases.filter(
-          r => r.published > mergeTime && r.url.includes(pull.base.repo.name)
-        )
+        const laterReleases = this.releases
         if (laterReleases.length === 0) {
           continue
killedBy: LeadTime should return 8 on pull-requests with base.ref = main and earlier release on other repo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 7

[Killed] ArrowFunction
src/LeadTime.ts:75:11
 
         const mergeTime = +new Date(pull.merged_at)
         const laterReleases = this.releases.filter(
-          r => r.published > mergeTime && r.url.includes(pull.base.repo.name)
+          () => undefined
         )
         if (laterReleases.length === 0) {
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] ConditionalExpression
src/LeadTime.ts:75:16
 
         const mergeTime = +new Date(pull.merged_at)
         const laterReleases = this.releases.filter(
-          r => r.published > mergeTime && r.url.includes(pull.base.repo.name)
+          r => true
         )
         if (laterReleases.length === 0) {
killedBy: LeadTime should return 8 on pull-requests with base.ref = main and earlier release on other repo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 7

[Killed] EqualityOperator
src/LeadTime.ts:77:13
         const laterReleases = this.releases.filter(
           r => r.published > mergeTime && r.url.includes(pull.base.repo.name)
         )
-        if (laterReleases.length === 0) {
+        if (laterReleases.length !== 0) {
           continue
         }
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] BlockStatement
src/LeadTime.ts:77:41
         const laterReleases = this.releases.filter(
           r => r.published > mergeTime && r.url.includes(pull.base.repo.name)
         )
-        if (laterReleases.length === 0) {
-          continue
-        }
+        if (laterReleases.length === 0) {}
         const deployTime: number = laterReleases[0].published
         this.log.push(`pull->      ${pull.merged_at} : ${pull.title}`)
killedBy: LeadTime should return 6 on three pull-requests with one commit each and two latest not released
statusReason: TypeError: Cannot read properties of undefined (reading 'published')

[Killed] MethodExpression
src/LeadTime.ts:85:36
         const commits = (await this.commitsAdapter.getCommitsFromUrl(
           pull.commits_url
         )) as Commit[]
-        const commitTime: number = commits
-          .map(c => +new Date(c.commit.committer.date))
-          .sort((a, b) => a - b)[0]
+        const commitTime: number = commits.map(c => +new Date(c.commit.committer.date))[0]
         const firstCommit = commits.sort((a, b) => {
           return (
killedBy: LeadTime should return 11 on pull-requests with two commits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11
Received: 8

[Killed] UnaryOperator
src/LeadTime.ts:86:21
           pull.commits_url
         )) as Commit[]
         const commitTime: number = commits
-          .map(c => +new Date(c.commit.committer.date))
+          .map(c => -new Date(c.commit.committer.date))
           .sort((a, b) => a - b)[0]
         const firstCommit = commits.sort((a, b) => {
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 38947.49

[Killed] ArithmeticOperator
src/LeadTime.ts:87:27
         )) as Commit[]
         const commitTime: number = commits
           .map(c => +new Date(c.commit.committer.date))
-          .sort((a, b) => a - b)[0]
+          .sort((a, b) => a + b)[0]
         const firstCommit = commits.sort((a, b) => {
           return (
killedBy: LeadTime should return 11 on pull-requests with two commits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11
Received: 8

[Survived] MethodExpression
src/LeadTime.ts:88:29
         const commitTime: number = commits
           .map(c => +new Date(c.commit.committer.date))
           .sort((a, b) => a - b)[0]
-        const firstCommit = commits.sort((a, b) => {
-          return (
-            +new Date(a.commit.committer.date) -
-            +new Date(b.commit.committer.date)
-          )
-        })[0]
+        const firstCommit = commits[0]
         this.log.push(
           `  commit->  ${firstCommit.commit.committer.date} : ${firstCommit.commit.message}`

[Survived] UnaryOperator
src/LeadTime.ts:90:13
           .sort((a, b) => a - b)[0]
         const firstCommit = commits.sort((a, b) => {
           return (
-            +new Date(a.commit.committer.date) -
+            -new Date(a.commit.committer.date) -
             +new Date(b.commit.committer.date)
           )

[Survived] ArithmeticOperator
src/LeadTime.ts:90:13
           .sort((a, b) => a - b)[0]
         const firstCommit = commits.sort((a, b) => {
           return (
-            +new Date(a.commit.committer.date) -
-            +new Date(b.commit.committer.date)
+            +new Date(a.commit.committer.date) + +new Date(b.commit.committer.date)
           )
         })[0]

[Survived] UnaryOperator
src/LeadTime.ts:91:13
         const firstCommit = commits.sort((a, b) => {
           return (
             +new Date(a.commit.committer.date) -
-            +new Date(b.commit.committer.date)
+            -new Date(b.commit.committer.date)
           )
         })[0]

[Killed] StringLiteral
src/LeadTime.ts:98:11
           `  commit->  ${firstCommit.commit.committer.date} : ${firstCommit.commit.message}`
         )
         this.log.push(
-          `  release-> ${laterReleases[0].published_at} : ${laterReleases[0].name}`
+          ``
         )
 
killedBy: LeadTime should get release log list weekly when rate calculated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArithmeticOperator
src/LeadTime.ts:101:27
           `  release-> ${laterReleases[0].published_at} : ${laterReleases[0].name}`
         )
 
-        const leadTime = (deployTime - commitTime) / ONE_DAY
+        const leadTime = (deployTime + commitTime) / ONE_DAY
         leadTimes.push(leadTime)
         this.log.push(`  ${leadTime.toFixed(2)} days`)
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 38947.49

[Killed] ArithmeticOperator
src/LeadTime.ts:101:26
           `  release-> ${laterReleases[0].published_at} : ${laterReleases[0].name}`
         )
 
-        const leadTime = (deployTime - commitTime) / ONE_DAY
+        const leadTime = (deployTime - commitTime) * ONE_DAY
         leadTimes.push(leadTime)
         this.log.push(`  ${leadTime.toFixed(2)} days`)
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 59719680000000000

[Killed] ConditionalExpression
src/LeadTime.ts:106:9
         this.log.push(`  ${leadTime.toFixed(2)} days`)
       }
     }
-    if (leadTimes.length === 0) {
+    if (false) {
       return 0
     }
killedBy: LeadTime should get event log list when lead time calculated and filtered with no fix or feat
statusReason: TypeError: Reduce of empty array with no initial value

[Killed] ConditionalExpression
src/LeadTime.ts:106:9
         this.log.push(`  ${leadTime.toFixed(2)} days`)
       }
     }
-    if (leadTimes.length === 0) {
+    if (true) {
       return 0
     }
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] ArithmeticOperator
src/LeadTime.ts:111:46
     }
 
     return (
-      Math.round((leadTimes.reduce((p, c) => p + c) / leadTimes.length) * 100) /
+      Math.round((leadTimes.reduce((p, c) => p - c) / leadTimes.length) * 100) /
       100
     )
killedBy: LeadTime should return 10.5 on pull-requests with two pulls on different repos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10.5
Received: 0.5

[Killed] ArithmeticOperator
src/LeadTime.ts:111:18
     }
 
     return (
-      Math.round((leadTimes.reduce((p, c) => p + c) / leadTimes.length) * 100) /
+      Math.round(leadTimes.reduce((p, c) => p + c) / leadTimes.length / 100) /
       100
     )
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0
