[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:31:9
     }
     this.issues = issues
     this.releases = releases
-    if (this.releases === null || this.releases.length === 0) {
+    if (false) {
       throw new Error('Empty release list')
     }
killedBy: MeanTimeToRestore should throw error when empty release list
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Empty release list"

Received function did not throw

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:31:35
     }
     this.issues = issues
     this.releases = releases
-    if (this.releases === null || this.releases.length === 0) {
+    if (this.releases === null || false) {
       throw new Error('Empty release list')
     }
killedBy: MeanTimeToRestore should throw error when empty release list
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Empty release list"

Received function did not throw

[Killed] MethodExpression
src/MeanTimeToRestore.ts:34:25
     if (this.releases === null || this.releases.length === 0) {
       throw new Error('Empty release list')
     }
-    this.releaseDates = this.releases
-      .map(function (r) {
-        return {published: +new Date(r.published_at), url: r.url}
-      })
-      .sort((a, b) => a.published - b.published) // Sort ascending
+    this.releaseDates = this.releases.map(function (r) {
+  return {
+    published: +new Date(r.published_at),
+    url: r.url
+  };
+}) // Sort ascending
   }
 
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] UnaryOperator
src/MeanTimeToRestore.ts:36:28
     }
     this.releaseDates = this.releases
       .map(function (r) {
-        return {published: +new Date(r.published_at), url: r.url}
+        return {published: -new Date(r.published_at), url: r.url}
       })
       .sort((a, b) => a.published - b.published) // Sort ascending
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ArithmeticOperator
src/MeanTimeToRestore.ts:38:23
       .map(function (r) {
         return {published: +new Date(r.published_at), url: r.url}
       })
-      .sort((a, b) => a.published - b.published) // Sort ascending
+      .sort((a, b) => a.published + b.published) // Sort ascending
   }
 
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] BlockStatement
src/MeanTimeToRestore.ts:50:29
 
   private getStartAndEndTimesForBugs(bugs: Issue[]): BugTime[] {
     const values: BugTime[] = []
-    for (const bug of bugs) {
-      const createdAt = +new Date(bug.created_at)
-      const closedAt = +new Date(bug.closed_at as string)
-      const repoName = bug.repository_url.split('/').reverse()[0]
-      if (
-        bug.closed_at != null &&
-        this.hasLaterRelease(closedAt, repoName) &&
-        this.hasPreviousRelease(createdAt, repoName)
-      ) {
-        values.push({
-          start: createdAt,
-          end: closedAt,
-          repo: repoName
-        })
-      }
-    }
+    for (const bug of bugs) {}
     return values
   }
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] UnaryOperator
src/MeanTimeToRestore.ts:51:25
   private getStartAndEndTimesForBugs(bugs: Issue[]): BugTime[] {
     const values: BugTime[] = []
     for (const bug of bugs) {
-      const createdAt = +new Date(bug.created_at)
+      const createdAt = -new Date(bug.created_at)
       const closedAt = +new Date(bug.closed_at as string)
       const repoName = bug.repository_url.split('/').reverse()[0]
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] UnaryOperator
src/MeanTimeToRestore.ts:52:24
     const values: BugTime[] = []
     for (const bug of bugs) {
       const createdAt = +new Date(bug.created_at)
-      const closedAt = +new Date(bug.closed_at as string)
+      const closedAt = -new Date(bug.closed_at as string)
       const repoName = bug.repository_url.split('/').reverse()[0]
       if (
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1682268460000
Received: -1682268460000

[Killed] MethodExpression
src/MeanTimeToRestore.ts:53:24
     for (const bug of bugs) {
       const createdAt = +new Date(bug.created_at)
       const closedAt = +new Date(bug.closed_at as string)
-      const repoName = bug.repository_url.split('/').reverse()[0]
+      const repoName = bug.repository_url.split('/')[0]
       if (
         bug.closed_at != null &&
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] LogicalOperator
src/MeanTimeToRestore.ts:55:9
       const closedAt = +new Date(bug.closed_at as string)
       const repoName = bug.repository_url.split('/').reverse()[0]
       if (
-        bug.closed_at != null &&
-        this.hasLaterRelease(closedAt, repoName) &&
+        bug.closed_at != null || this.hasLaterRelease(closedAt, repoName) &&
         this.hasPreviousRelease(createdAt, repoName)
       ) {
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: No later releases

[Killed] EqualityOperator
src/MeanTimeToRestore.ts:55:9
       const closedAt = +new Date(bug.closed_at as string)
       const repoName = bug.repository_url.split('/').reverse()[0]
       if (
-        bug.closed_at != null &&
+        bug.closed_at == null &&
         this.hasLaterRelease(closedAt, repoName) &&
         this.hasPreviousRelease(createdAt, repoName)
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/MeanTimeToRestore.ts:58:9
         bug.closed_at != null &&
         this.hasLaterRelease(closedAt, repoName) &&
         this.hasPreviousRelease(createdAt, repoName)
-      ) {
-        values.push({
-          start: createdAt,
-          end: closedAt,
-          repo: repoName
-        })
-      }
+      ) {}
     }
     return values
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/MeanTimeToRestore.ts:71:38
 
   private getIssuesTaggedAsBug(): Issue[] {
     const bugs: Issue[] = []
-    for (const issue of this.issues) {
-      const createdAt = +new Date(issue.created_at)
-      if (
-        issue.labels.filter(label => label.name === 'bug').length > 0 &&
-        createdAt > this.today.getTime() - 30 * ONE_DAY
-      ) {
-        bugs.push(issue)
-      }
-    }
+    for (const issue of this.issues) {}
     return bugs
   }
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] UnaryOperator
src/MeanTimeToRestore.ts:72:25
   private getIssuesTaggedAsBug(): Issue[] {
     const bugs: Issue[] = []
     for (const issue of this.issues) {
-      const createdAt = +new Date(issue.created_at)
+      const createdAt = -new Date(issue.created_at)
       if (
         issue.labels.filter(label => label.name === 'bug').length > 0 &&
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:74:38
     for (const issue of this.issues) {
       const createdAt = +new Date(issue.created_at)
       if (
-        issue.labels.filter(label => label.name === 'bug').length > 0 &&
+        issue.labels.filter(label => false).length > 0 &&
         createdAt > this.today.getTime() - 30 * ONE_DAY
       ) {
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] MethodExpression
src/MeanTimeToRestore.ts:74:9
     for (const issue of this.issues) {
       const createdAt = +new Date(issue.created_at)
       if (
-        issue.labels.filter(label => label.name === 'bug').length > 0 &&
+        issue.labels.length > 0 &&
         createdAt > this.today.getTime() - 30 * ONE_DAY
       ) {
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 12

[Killed] ArithmeticOperator
src/MeanTimeToRestore.ts:75:44
       const createdAt = +new Date(issue.created_at)
       if (
         issue.labels.filter(label => label.name === 'bug').length > 0 &&
-        createdAt > this.today.getTime() - 30 * ONE_DAY
+        createdAt > this.today.getTime() - 30 / ONE_DAY
       ) {
         bugs.push(issue)
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
src/MeanTimeToRestore.ts:75:9
       const createdAt = +new Date(issue.created_at)
       if (
         issue.labels.filter(label => label.name === 'bug').length > 0 &&
-        createdAt > this.today.getTime() - 30 * ONE_DAY
+        createdAt <= this.today.getTime() - 30 * ONE_DAY
       ) {
         bugs.push(issue)
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/MeanTimeToRestore.ts:76:9
       if (
         issue.labels.filter(label => label.name === 'bug').length > 0 &&
         createdAt > this.today.getTime() - 30 * ONE_DAY
-      ) {
-        bugs.push(issue)
-      }
+      ) {}
     }
     return bugs
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
src/MeanTimeToRestore.ts:85:7
 
   hasPreviousRelease(date: number, repo: string): boolean {
     return (
-      this.releaseDates.filter(r => r.published < date && r.url.includes(repo))
-        .length > 0
+      this.releaseDates.filter(r => r.published < date && r.url.includes(repo)).length <= 0
     )
   }
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArrowFunction
src/MeanTimeToRestore.ts:85:32
 
   hasPreviousRelease(date: number, repo: string): boolean {
     return (
-      this.releaseDates.filter(r => r.published < date && r.url.includes(repo))
+      this.releaseDates.filter(() => undefined)
         .length > 0
     )
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] MethodExpression
src/MeanTimeToRestore.ts:91:35
   }
 
   getReleaseBefore(date: number, repo: string): ReleaseDate {
-    const rdates: ReleaseDate[] = this.releaseDates.filter(
-      r => r.published < date && r.url.includes(repo)
-    )
+    const rdates: ReleaseDate[] = this.releaseDates
 
     if (rdates.length === 0) {
killedBy: MeanTimeToRestore should find release time before date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1682195309000
Received: 1682875784000

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:92:12
 
   getReleaseBefore(date: number, repo: string): ReleaseDate {
     const rdates: ReleaseDate[] = this.releaseDates.filter(
-      r => r.published < date && r.url.includes(repo)
+      r => true
     )
 
killedBy: MeanTimeToRestore should find release time before date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1682195309000
Received: 1682875784000

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:92:12
 
   getReleaseBefore(date: number, repo: string): ReleaseDate {
     const rdates: ReleaseDate[] = this.releaseDates.filter(
-      r => r.published < date && r.url.includes(repo)
+      r => true && r.url.includes(repo)
     )
 
killedBy: MeanTimeToRestore should find release time before date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1682195309000
Received: 1682875784000

[Killed] BlockStatement
src/MeanTimeToRestore.ts:95:30
       r => r.published < date && r.url.includes(repo)
     )
 
-    if (rdates.length === 0) {
-      throw new Error('No previous releases')
-    }
+    if (rdates.length === 0) {}
 
     return rdates.pop() as ReleaseDate
killedBy: MeanTimeToRestore should throw error when no earlier dates
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No previous releases"

Received function did not throw

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:95:9
       r => r.published < date && r.url.includes(repo)
     )
 
-    if (rdates.length === 0) {
+    if (true) {
       throw new Error('No previous releases')
     }
killedBy: MeanTimeToRestore should find release time before date
statusReason: Error: No previous releases

[Killed] MethodExpression
src/MeanTimeToRestore.ts:103:35
   }
 
   getReleaseAfter(date: number, repo: string): ReleaseDate {
-    const rdates: ReleaseDate[] = this.releaseDates.filter(
-      r => r.published > date && r.url.includes(repo)
-    )
+    const rdates: ReleaseDate[] = this.releaseDates
 
     if (rdates.length === 0) {
killedBy: MeanTimeToRestore should find release time after date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1682749116000
Received: 1681338804000

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:104:12
 
   getReleaseAfter(date: number, repo: string): ReleaseDate {
     const rdates: ReleaseDate[] = this.releaseDates.filter(
-      r => r.published > date && r.url.includes(repo)
+      r => true
     )
 
killedBy: MeanTimeToRestore should find release time after date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1682749116000
Received: 1681338804000

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:104:12
 
   getReleaseAfter(date: number, repo: string): ReleaseDate {
     const rdates: ReleaseDate[] = this.releaseDates.filter(
-      r => r.published > date && r.url.includes(repo)
+      r => true && r.url.includes(repo)
     )
 
killedBy: MeanTimeToRestore should find release time after date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1682749116000
Received: 1681338804000

[Killed] EqualityOperator
src/MeanTimeToRestore.ts:107:9
       r => r.published > date && r.url.includes(repo)
     )
 
-    if (rdates.length === 0) {
+    if (rdates.length !== 0) {
       throw new Error('No later releases')
     }
killedBy: MeanTimeToRestore should find release time after date
statusReason: Error: No later releases

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:107:9
       r => r.published > date && r.url.includes(repo)
     )
 
-    if (rdates.length === 0) {
+    if (false) {
       throw new Error('No later releases')
     }
killedBy: MeanTimeToRestore should throw error when no later dates
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No later releases"

Received function did not throw

[Killed] StringLiteral
src/MeanTimeToRestore.ts:108:23
     )
 
     if (rdates.length === 0) {
-      throw new Error('No later releases')
+      throw new Error("")
     }
 
killedBy: MeanTimeToRestore should throw error when no later dates
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No later releases"
Received message:   ""

      214 |         } else {
      215 |           stryCov_9fa48("387");
    > 216 |           throw new Error(stryMutAct_9fa48("388") ? "" : (stryCov_9fa48("388"), 'No later releases'));

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:116:7
 
   hasLaterRelease(date: number, repo: string): boolean {
     return (
-      this.releaseDates.filter(r => r.published > date && r.url.includes(repo))
-        .length > 0
+      true
     )
   }
killedBy: MeanTimeToRestore should check if there are later releases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:116:37
 
   hasLaterRelease(date: number, repo: string): boolean {
     return (
-      this.releaseDates.filter(r => r.published > date && r.url.includes(repo))
+      this.releaseDates.filter(r => false)
         .length > 0
     )
killedBy: MeanTimeToRestore should get bugs last month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArithmeticOperator
src/MeanTimeToRestore.ts:125:12
     const prevRel = this.getReleaseBefore(bug.start, bug.repo)
     const nextRel = this.getReleaseAfter(bug.end, bug.repo)
 
-    return nextRel.published - prevRel.published
+    return nextRel.published + prevRel.published
   }
 
killedBy: MeanTimeToRestore should get time for a bug 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 553807000
Received: 3364944425000

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:133:9
       return this.getRestoreTime(bug)
     }, this)
 
-    if (ttr.length === 0) {
+    if (false) {
       return 0
     }
killedBy: MeanTimeToRestore should return 0 when no bugs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:133:9
       return this.getRestoreTime(bug)
     }, this)
 
-    if (ttr.length === 0) {
+    if (true) {
       return 0
     }
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
src/MeanTimeToRestore.ts:138:35
     }
 
     let sum = 0
-    for (const ttrElement of ttr) {
-      sum += ttrElement
-    }
+    for (const ttrElement of ttr) {}
 
     return Math.round((sum / ttr.length / ONE_DAY) * 100) / 100 // Two decimals
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] AssignmentOperator
src/MeanTimeToRestore.ts:139:7
 
     let sum = 0
     for (const ttrElement of ttr) {
-      sum += ttrElement
+      sum -= ttrElement
     }
 
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -4

[Killed] ArithmeticOperator
src/MeanTimeToRestore.ts:142:12
       sum += ttrElement
     }
 
-    return Math.round((sum / ttr.length / ONE_DAY) * 100) / 100 // Two decimals
+    return Math.round(sum / ttr.length / ONE_DAY * 100) * 100 // Two decimals
   }
 }
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 40000

[Killed] ArithmeticOperator
src/MeanTimeToRestore.ts:142:23
       sum += ttrElement
     }
 
-    return Math.round((sum / ttr.length / ONE_DAY) * 100) / 100 // Two decimals
+    return Math.round(sum / ttr.length / ONE_DAY / 100) / 100 // Two decimals
   }
 }
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0
