[Killed] MethodExpression
src/ChangeFailureRate.ts:13:21
   constructor(issues: Issue[], releases: Release[], today: Date | null = null) {
     this.today = today === null ? new Date() : today
     this.issues = issues
-    this.releases = releases
-      .sort((a, b) =>
-        +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1
-      )
+    this.releases = releases
       .filter(
         r =>
killedBy: ChangeFailureRate should calculate 100% failures on 2 issues after latest release and one before
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 50

[Killed] MethodExpression
src/ChangeFailureRate.ts:13:21
   constructor(issues: Issue[], releases: Release[], today: Date | null = null) {
     this.today = today === null ? new Date() : today
     this.issues = issues
-    this.releases = releases
-      .sort((a, b) =>
-        +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1
-      )
-      .filter(
-        r =>
-          +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
-      )
+    this.releases = releases.sort((a, b) => +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1)
     this.repos = []
   }
killedBy: ChangeFailureRate should calculate 0% failures on 1 issues on 1 release when more than a month ago
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:15:9
     this.issues = issues
     this.releases = releases
       .sort((a, b) =>
-        +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1
+        false ? -1 : 1
       )
       .filter(
killedBy: ChangeFailureRate should calculate 100% failures on 2 issues after latest release and one before
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 50

[Killed] EqualityOperator
src/ChangeFailureRate.ts:15:9
     this.issues = issues
     this.releases = releases
       .sort((a, b) =>
-        +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1
+        +new Date(a.published_at) >= +new Date(b.published_at) ? -1 : 1
       )
       .filter(
killedBy: ChangeFailureRate should calculate 100% failures on 2 issues after latest release and one before
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 50

[Killed] ArrowFunction
src/ChangeFailureRate.ts:18:9
         +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1
       )
       .filter(
-        r =>
-          +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
+        () => undefined
       )
     this.repos = []
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:19:11
       )
       .filter(
         r =>
-          +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
+          false
       )
     this.repos = []
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] EqualityOperator
src/ChangeFailureRate.ts:19:11
       )
       .filter(
         r =>
-          +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
+          +new Date(r.published_at) <= this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
       )
     this.repos = []
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] ArithmeticOperator
src/ChangeFailureRate.ts:20:34
       .filter(
         r =>
           +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
+          this.today.valueOf() - 31 * 24 * 60 * 60 / 1000
       )
     this.repos = []
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] ArithmeticOperator
src/ChangeFailureRate.ts:20:34
       .filter(
         r =>
           +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
+          this.today.valueOf() - 31 * 24 / 60 * 60 * 1000
       )
     this.repos = []
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Survived] ArrayDeclaration
src/ChangeFailureRate.ts:22:18
           +new Date(r.published_at) >
           this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
       )
-    this.repos = []
+    this.repos = ["Stryker was here"]
   }
 

[Killed] BlockStatement
src/ChangeFailureRate.ts:27:38
 
   getBugs(): Issue[] {
     const bugs: Issue[] = []
-    for (const issue of this.issues) {
-      if (issue.labels.filter(label => label.name === 'bug').length > 0) {
-        bugs.push(issue)
-      }
-    }
+    for (const issue of this.issues) {}
 
     return bugs
killedBy: ChangeFailureRate should get number of bugs created
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
src/ChangeFailureRate.ts:28:40
   getBugs(): Issue[] {
     const bugs: Issue[] = []
     for (const issue of this.issues) {
-      if (issue.labels.filter(label => label.name === 'bug').length > 0) {
+      if (issue.labels.filter(label => label.name !== 'bug').length > 0) {
         bugs.push(issue)
       }
killedBy: ChangeFailureRate should get number of bugs created
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 16

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:28:40
   getBugs(): Issue[] {
     const bugs: Issue[] = []
     for (const issue of this.issues) {
-      if (issue.labels.filter(label => label.name === 'bug').length > 0) {
+      if (issue.labels.filter(label => false).length > 0) {
         bugs.push(issue)
       }
killedBy: ChangeFailureRate should get number of bugs created
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/ChangeFailureRate.ts:37:65
   }
 
   Cfr(): number {
-    if (this.issues.length === 0 || this.releases.length === 0) {
-      return 0
-    }
+    if (this.issues.length === 0 || this.releases.length === 0) {}
     const bugs = this.getBugs()
 
killedBy: ChangeFailureRate should calculate 0 failures on 0 releases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] LogicalOperator
src/ChangeFailureRate.ts:37:9
   }
 
   Cfr(): number {
-    if (this.issues.length === 0 || this.releases.length === 0) {
+    if (this.issues.length === 0 && this.releases.length === 0) {
       return 0
     }
killedBy: ChangeFailureRate should calculate 0 failures on 0 releases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] BlockStatement
src/ChangeFailureRate.ts:42:29
     }
     const bugs = this.getBugs()
 
-    for (const bug of bugs) {
-      const repo = bug.repository_url.split('/').reverse()[0]
-      if (!this.repos.includes(repo)) {
-        this.repos.push(repo)
-      }
-    }
+    for (const bug of bugs) {}
     // const bugDates = this.getBugs().map(issue => +new Date(issue.created_at))
     const releaseDates = this.releases.map(function (release) {
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] MethodExpression
src/ChangeFailureRate.ts:43:20
     const bugs = this.getBugs()
 
     for (const bug of bugs) {
-      const repo = bug.repository_url.split('/').reverse()[0]
+      const repo = bug.repository_url.split('/')[0]
       if (!this.repos.includes(repo)) {
         this.repos.push(repo)
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] BlockStatement
src/ChangeFailureRate.ts:44:39
 
     for (const bug of bugs) {
       const repo = bug.repository_url.split('/').reverse()[0]
-      if (!this.repos.includes(repo)) {
-        this.repos.push(repo)
-      }
+      if (!this.repos.includes(repo)) {}
     }
     // const bugDates = this.getBugs().map(issue => +new Date(issue.created_at))
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:44:11
 
     for (const bug of bugs) {
       const repo = bug.repository_url.split('/').reverse()[0]
-      if (!this.repos.includes(repo)) {
+      if (true) {
         this.repos.push(repo)
       }
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 29

[Killed] UnaryOperator
src/ChangeFailureRate.ts:50:26
     }
     // const bugDates = this.getBugs().map(issue => +new Date(issue.created_at))
     const releaseDates = this.releases.map(function (release) {
-      return {published: +new Date(release.published_at), url: release.url}
+      return {published: -new Date(release.published_at), url: release.url}
     })
     for (const repo of this.repos) {
killedBy: ChangeFailureRate should calculate 100% failures on 2 issues after latest release and one before
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 50

[Killed] BlockStatement
src/ChangeFailureRate.ts:52:36
     const releaseDates = this.releases.map(function (release) {
       return {published: +new Date(release.published_at), url: release.url}
     })
-    for (const repo of this.repos) {
-      releaseDates.push({published: Date.now(), url: repo})
-    }
+    for (const repo of this.repos) {}
 
     let failedDeploys = 0
killedBy: ChangeFailureRate should calculate 100% failures on 1 issues on 1 release
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] BlockStatement
src/ChangeFailureRate.ts:57:36
     }
 
     let failedDeploys = 0
-    for (const repo of this.repos) {
-      const releasesForRepo = releaseDates.filter(r => r.url.includes(repo))
-      for (let i = 0; i < releasesForRepo.length - 1; i++) {
-        if (
-          bugs.filter(function (bug) {
-            if (bug.repository_url.split('/').reverse()[0] !== repo) {
-              return false
-            }
-            const bugDate = +new Date(bug.created_at)
-            return (
-              bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
-            )
-          }).length > 0
-        ) {
-          failedDeploys += 1
-        }
-      }
-    }
+    for (const repo of this.repos) {}
     return Math.round((failedDeploys / this.releases.length) * 100)
   }
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] ArrowFunction
src/ChangeFailureRate.ts:58:51
 
     let failedDeploys = 0
     for (const repo of this.repos) {
-      const releasesForRepo = releaseDates.filter(r => r.url.includes(repo))
+      const releasesForRepo = releaseDates.filter(() => undefined)
       for (let i = 0; i < releasesForRepo.length - 1; i++) {
         if (
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] MethodExpression
src/ChangeFailureRate.ts:58:31
 
     let failedDeploys = 0
     for (const repo of this.repos) {
-      const releasesForRepo = releaseDates.filter(r => r.url.includes(repo))
+      const releasesForRepo = releaseDates
       for (let i = 0; i < releasesForRepo.length - 1; i++) {
         if (
killedBy: ChangeFailureRate should calculate 0% failures on 1 issues on release on other repo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] ArithmeticOperator
src/ChangeFailureRate.ts:59:27
     let failedDeploys = 0
     for (const repo of this.repos) {
       const releasesForRepo = releaseDates.filter(r => r.url.includes(repo))
-      for (let i = 0; i < releasesForRepo.length - 1; i++) {
+      for (let i = 0; i < releasesForRepo.length + 1; i++) {
         if (
           bugs.filter(function (bug) {
killedBy: ChangeFailureRate should get percentage rate
statusReason: TypeError: Cannot read properties of undefined (reading 'published')

[Killed] BlockStatement
src/ChangeFailureRate.ts:59:60
     let failedDeploys = 0
     for (const repo of this.repos) {
       const releasesForRepo = releaseDates.filter(r => r.url.includes(repo))
-      for (let i = 0; i < releasesForRepo.length - 1; i++) {
-        if (
-          bugs.filter(function (bug) {
-            if (bug.repository_url.split('/').reverse()[0] !== repo) {
-              return false
-            }
-            const bugDate = +new Date(bug.created_at)
-            return (
-              bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
-            )
-          }).length > 0
-        ) {
-          failedDeploys += 1
-        }
-      }
+      for (let i = 0; i < releasesForRepo.length - 1; i++) {}
     }
     return Math.round((failedDeploys / this.releases.length) * 100)
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:61:11
       const releasesForRepo = releaseDates.filter(r => r.url.includes(repo))
       for (let i = 0; i < releasesForRepo.length - 1; i++) {
         if (
-          bugs.filter(function (bug) {
-            if (bug.repository_url.split('/').reverse()[0] !== repo) {
-              return false
-            }
-            const bugDate = +new Date(bug.created_at)
-            return (
-              bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
-            )
-          }).length > 0
+          true
         ) {
           failedDeploys += 1
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 100

[Killed] MethodExpression
src/ChangeFailureRate.ts:61:11
       const releasesForRepo = releaseDates.filter(r => r.url.includes(repo))
       for (let i = 0; i < releasesForRepo.length - 1; i++) {
         if (
-          bugs.filter(function (bug) {
-            if (bug.repository_url.split('/').reverse()[0] !== repo) {
-              return false
-            }
-            const bugDate = +new Date(bug.created_at)
-            return (
-              bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
-            )
-          }).length > 0
+          bugs.length > 0
         ) {
           failedDeploys += 1
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 100

[Killed] EqualityOperator
src/ChangeFailureRate.ts:62:17
       for (let i = 0; i < releasesForRepo.length - 1; i++) {
         if (
           bugs.filter(function (bug) {
-            if (bug.repository_url.split('/').reverse()[0] !== repo) {
+            if (bug.repository_url.split('/').reverse()[0] === repo) {
               return false
             }
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:62:17
       for (let i = 0; i < releasesForRepo.length - 1; i++) {
         if (
           bugs.filter(function (bug) {
-            if (bug.repository_url.split('/').reverse()[0] !== repo) {
+            if (true) {
               return false
             }
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] BooleanLiteral
src/ChangeFailureRate.ts:63:22
         if (
           bugs.filter(function (bug) {
             if (bug.repository_url.split('/').reverse()[0] !== repo) {
-              return false
+              return true
             }
             const bugDate = +new Date(bug.created_at)
killedBy: ChangeFailureRate should calculate 50% failures on 3 issues on two repos on two of 4 releases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 100

[Killed] UnaryOperator
src/ChangeFailureRate.ts:65:29
             if (bug.repository_url.split('/').reverse()[0] !== repo) {
               return false
             }
-            const bugDate = +new Date(bug.created_at)
+            const bugDate = -new Date(bug.created_at)
             return (
               bugDate > releasesForRepo[i].published &&
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] LogicalOperator
src/ChangeFailureRate.ts:67:15
             }
             const bugDate = +new Date(bug.created_at)
             return (
-              bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
+              bugDate > releasesForRepo[i].published || bugDate < releasesForRepo[i + 1].published
             )
           }).length > 0
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 100

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:67:15
             }
             const bugDate = +new Date(bug.created_at)
             return (
-              bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
+              false
             )
           }).length > 0
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] EqualityOperator
src/ChangeFailureRate.ts:68:15
             const bugDate = +new Date(bug.created_at)
             return (
               bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
+              bugDate >= releasesForRepo[i + 1].published
             )
           }).length > 0
killedBy: ChangeFailureRate should calculate 100% failures on 1 issues on 1 release
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ArithmeticOperator
src/ChangeFailureRate.ts:68:41
             const bugDate = +new Date(bug.created_at)
             return (
               bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
+              bugDate < releasesForRepo[i - 1].published
             )
           }).length > 0
killedBy: ChangeFailureRate should get percentage rate
statusReason: TypeError: Cannot read properties of undefined (reading 'published')

[Killed] BlockStatement
src/ChangeFailureRate.ts:71:11
               bugDate < releasesForRepo[i + 1].published
             )
           }).length > 0
-        ) {
-          failedDeploys += 1
-        }
+        ) {}
       }
     }
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] AssignmentOperator
src/ChangeFailureRate.ts:72:11
             )
           }).length > 0
         ) {
-          failedDeploys += 1
+          failedDeploys -= 1
         }
       }
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: -14

[Killed] ArithmeticOperator
src/ChangeFailureRate.ts:76:24
         }
       }
     }
-    return Math.round((failedDeploys / this.releases.length) * 100)
+    return Math.round((failedDeploys * this.releases.length) * 100)
   }
 }
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 700

[Killed] ArithmeticOperator
src/ChangeFailureRate.ts:76:23
         }
       }
     }
-    return Math.round((failedDeploys / this.releases.length) * 100)
+    return Math.round(failedDeploys / this.releases.length / 100)
   }
 }
killedBy: ChangeFailureRate should get percentage rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0
