[Killed] BlockStatement
src/CommitsAdapter.ts:22:22
       const result = await this.getCommits(this.octokit, url)
 
       return result
-    } catch (e: any) {
-      core.setFailed(e.message)
-    }
+    } catch (e: any) {}
   }
 
killedBy: Commit Adapter should handles access denied
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Bad credentials"

Number of calls: 0
