[Killed] ArithmeticOperator
src/IssuesAdapter.ts:25:51
   }
 
   async GetAllIssuesLastMonth(): Promise<Issue[] | undefined> {
-    const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 * 1000) // Go two months back
+    const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 / 1000) // Go two months back
     try {
       const octokit = new Octokit({
killedBy: Real Issues API should fetch issues
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 10
Received:   0

[Killed] ArithmeticOperator
src/IssuesAdapter.ts:25:28
   }
 
   async GetAllIssuesLastMonth(): Promise<Issue[] | undefined> {
-    const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 * 1000) // Go two months back
+    const since = new Date(this.today.valueOf() + 61 * 24 * 60 * 60 * 1000) // Go two months back
     try {
       const octokit = new Octokit({
killedBy: Real Issues API should fetch issues
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 10
Received:   0

[Killed] BlockStatement
src/IssuesAdapter.ts:32:45
       })
 
       let result: Issue[] | undefined = []
-      for (const repo of this.repositories) {
-        let nextPage = await this.getIssues(octokit, repo, since, 1)
-        result = result.concat(nextPage)
-        for (let page = 2; page < 100 && nextPage.length === 100; page++) {
-          nextPage = await this.getIssues(octokit, repo, since, page)
-          result = result.concat(nextPage)
-        }
-      }
+      for (const repo of this.repositories) {}
 
       return result
killedBy: Real Issues API should fetch issues
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 10
Received:   0

[Killed] ConditionalExpression
src/IssuesAdapter.ts:35:42
       for (const repo of this.repositories) {
         let nextPage = await this.getIssues(octokit, repo, since, 1)
         result = result.concat(nextPage)
-        for (let page = 2; page < 100 && nextPage.length === 100; page++) {
+        for (let page = 2; page < 100 && true; page++) {
           nextPage = await this.getIssues(octokit, repo, since, page)
           result = result.concat(nextPage)
killedBy: Real Issues API should fetch issues
statusReason: Error: expect(received).toBeGreaterThan(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] LogicalOperator
src/IssuesAdapter.ts:35:28
       for (const repo of this.repositories) {
         let nextPage = await this.getIssues(octokit, repo, since, 1)
         result = result.concat(nextPage)
-        for (let page = 2; page < 100 && nextPage.length === 100; page++) {
+        for (let page = 2; page < 100 || nextPage.length === 100; page++) {
           nextPage = await this.getIssues(octokit, repo, since, page)
           result = result.concat(nextPage)
killedBy: Real Issues API should fetch issues
statusReason: Error: expect(received).toBeGreaterThan(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] StringLiteral
src/IssuesAdapter.ts:54:7
     page: number
   ): Promise<Issue[]> {
     const result = await octokit.request(
-      'GET /repos/{owner}/{repo}/issues?state=all&since={since}&per_page={per_page}&page={page}',
+      "",
       {
         owner: this.owner,
killedBy: Real Issues API should fetch issues
statusReason: Error: expect(received).toBeGreaterThan(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined
