[Survived] ArithmeticOperator
src/PullRequestsAdapter.ts:25:51
   }
 
   async GetAllPRsLastMonth(): Promise<PullRequest[] | undefined> {
-    const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 * 1000) // Go two months back
+    const since = new Date(this.today.valueOf() - 61 / 24 * 60 * 60 * 1000) // Go two months back
     try {
       const octokit = new Octokit({

[Survived] ArithmeticOperator
src/PullRequestsAdapter.ts:25:51
   }
 
   async GetAllPRsLastMonth(): Promise<PullRequest[] | undefined> {
-    const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 * 1000) // Go two months back
+    const since = new Date(this.today.valueOf() - 61 * 24 / 60 * 60 * 1000) // Go two months back
     try {
       const octokit = new Octokit({

[Survived] ObjectLiteral
src/PullRequestsAdapter.ts:27:35
   async GetAllPRsLastMonth(): Promise<PullRequest[] | undefined> {
     const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 * 1000) // Go two months back
     try {
-      const octokit = new Octokit({
-        auth: this.token
-      })
+      const octokit = new Octokit({})
 
       let result: PullRequest[] | undefined = []

[Killed] BlockStatement
src/PullRequestsAdapter.ts:32:45
       })
 
       let result: PullRequest[] | undefined = []
-      for (const repo of this.repositories) {
-        let nextPage = await this.getPRs(octokit, repo, since, 1)
-        result = result.concat(nextPage)
-        for (let page = 2; page < 100 && nextPage.length === 100; page++) {
-          nextPage = await this.getPRs(octokit, repo, since, page)
-          result = result.concat(nextPage)
-        }
-      }
+      for (const repo of this.repositories) {}
 
       return result
killedBy: PullRequest Adapter should return paged values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 150
Received: 0

[Killed] BlockStatement
src/PullRequestsAdapter.ts:35:75
       for (const repo of this.repositories) {
         let nextPage = await this.getPRs(octokit, repo, since, 1)
         result = result.concat(nextPage)
-        for (let page = 2; page < 100 && nextPage.length === 100; page++) {
-          nextPage = await this.getPRs(octokit, repo, since, page)
-          result = result.concat(nextPage)
-        }
+        for (let page = 2; page < 100 && nextPage.length === 100; page++) {}
       }
 
killedBy: PullRequest Adapter should return paged values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 150
Received: 100
