[Survived] ArithmeticOperator
src/ReleaseAdapter.ts:23:51
     this.today = new Date()
   }
   async GetAllReleasesLastMonth(): Promise<Release[] | undefined> {
-    const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 * 1000) // Go two months back
+    const since = new Date(this.today.valueOf() - 61 * 24 / 60 * 60 * 1000) // Go two months back
     try {
       const octokit = new Octokit({

[Survived] ArithmeticOperator
src/ReleaseAdapter.ts:23:51
     this.today = new Date()
   }
   async GetAllReleasesLastMonth(): Promise<Release[] | undefined> {
-    const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 * 1000) // Go two months back
+    const since = new Date(this.today.valueOf() - 61 * 24 * 60 * 60 / 1000) // Go two months back
     try {
       const octokit = new Octokit({

[Killed] BlockStatement
src/ReleaseAdapter.ts:30:45
       })
 
       let result: Release[] | undefined = []
-      for (const repo of this.repositories) {
-        let nextPage = await this.getReleases(octokit, repo, since, 1)
-        result = result.concat(nextPage)
-        for (let page = 2; page < 100 && nextPage.length === 100; page++) {
-          nextPage = await this.getReleases(octokit, repo, since, page)
-          result = result.concat(nextPage)
-        }
-      }
+      for (const repo of this.repositories) {}
 
       return result
killedBy: Release Adapter should return paged values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 150
Received: 0

[Killed] EqualityOperator
src/ReleaseAdapter.ts:33:42
       for (const repo of this.repositories) {
         let nextPage = await this.getReleases(octokit, repo, since, 1)
         result = result.concat(nextPage)
-        for (let page = 2; page < 100 && nextPage.length === 100; page++) {
+        for (let page = 2; page < 100 && nextPage.length !== 100; page++) {
           nextPage = await this.getReleases(octokit, repo, since, page)
           result = result.concat(nextPage)
killedBy: Release Adapter should return paged values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 150
Received: 100

[Killed] BlockStatement
src/ReleaseAdapter.ts:41:22
 
       return result
       // eslint-disable-next-line @typescript-eslint/no-explicit-any
-    } catch (e: any) {
-      core.setFailed(e.message)
-    }
+    } catch (e: any) {}
   }
 
killedBy: Release Adapter should handles access denied
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "access denied"

Number of calls: 0

[Killed] StringLiteral
src/ReleaseAdapter.ts:53:7
     page: number
   ): Promise<Release[]> {
     const result = await octokit.request(
-      'GET /repos/{owner}/{repo}/releases?state=all&since={since}&per_page={per_page}&page={page}',
+      "",
       {
         owner: this.owner,
killedBy: Release Adapter should return paged values
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
src/ReleaseAdapter.ts:54:7
   ): Promise<Release[]> {
     const result = await octokit.request(
       'GET /repos/{owner}/{repo}/releases?state=all&since={since}&per_page={per_page}&page={page}',
-      {
-        owner: this.owner,
-        repo,
-        headers: {
-          'X-GitHub-Api-Version': '2022-11-28'
-        },
-        since: since.toISOString(),
-        per_page: 100,
-        page
-      }
+      {}
     )
     return Promise.resolve(result.data) as Promise<Release[]>
killedBy: Release Adapter should return paged values
statusReason: TypeError: Cannot read properties of undefined (reading 'length')
