[Killed] LogicalOperator
src/index.ts:19:9
 export async function run(): Promise<void> {
   try {
     let repo: string = core.getInput('repo')
-    if (repo === '' || repo === null) {
+    if (repo === '' && repo === null) {
       repo = github.context.repo.repo
       core.info(`${github.context.repo.repo} - default repo.`)
killedBy: run should use default repo and owner when inputs are not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "defaultRepo - default repo."
Received
       1: "defaultOwner - default owner."
       2: "0 repository registered."

Number of calls: 2

[Killed] ConditionalExpression
src/index.ts:19:9
 export async function run(): Promise<void> {
   try {
     let repo: string = core.getInput('repo')
-    if (repo === '' || repo === null) {
+    if (true) {
       repo = github.context.repo.repo
       core.info(`${github.context.repo.repo} - default repo.`)
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testOwner/repo1"
Received
       1: "defaultRepo - default repo."
       2: "testOwner/defaultRepo"
       3: "1 repository registered."

[Killed] StringLiteral
src/index.ts:21:17
     let repo: string = core.getInput('repo')
     if (repo === '' || repo === null) {
       repo = github.context.repo.repo
-      core.info(`${github.context.repo.repo} - default repo.`)
+      core.info(``)
     }
 
killedBy: run should use default repo and owner when inputs are not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "defaultRepo - default repo."
Received
       1: ""
       2: "defaultOwner - default owner."
       3: "defaultOwner/defaultRepo"

[Survived] MethodExpression
src/index.ts:25:26
     }
 
     // Allow for multiple repos, ex: [val1, val2, val3]
-    const repositories = repo
-      .split(/[[\]\n,]+/)
-      .map(s => s.trim())
-      .filter(x => x !== '')
+    const repositories = repo.split(/[[\]\n,]+/).map(s => s.trim())
 
     let owner: string = core.getInput('owner')

[Killed] Regex
src/index.ts:26:14
 
     // Allow for multiple repos, ex: [val1, val2, val3]
     const repositories = repo
-      .split(/[[\]\n,]+/)
+      .split(/[^[\]\n,]+/)
       .map(s => s.trim())
       .filter(x => x !== '')
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testOwner/repo1"
Received
       1: "testOwner/,"
       2: "1 repository registered."

Number of calls: 2

[Survived] MethodExpression
src/index.ts:27:17
     // Allow for multiple repos, ex: [val1, val2, val3]
     const repositories = repo
       .split(/[[\]\n,]+/)
-      .map(s => s.trim())
+      .map(s => s)
       .filter(x => x !== '')
 

[Killed] ArrowFunction
src/index.ts:28:15
     const repositories = repo
       .split(/[[\]\n,]+/)
       .map(s => s.trim())
-      .filter(x => x !== '')
+      .filter(() => undefined)
 
     let owner: string = core.getInput('owner')
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testOwner/repo1"
Received: "0 repository registered."

Number of calls: 1

[Killed] ConditionalExpression
src/index.ts:28:20
     const repositories = repo
       .split(/[[\]\n,]+/)
       .map(s => s.trim())
-      .filter(x => x !== '')
+      .filter(x => false)
 
     let owner: string = core.getInput('owner')
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testOwner/repo1"
Received: "0 repository registered."

Number of calls: 1

[Killed] LogicalOperator
src/index.ts:31:9
       .filter(x => x !== '')
 
     let owner: string = core.getInput('owner')
-    if (owner === '' || owner === null) {
+    if (owner === '' && owner === null) {
       owner = github.context.repo.owner
       core.info(`${github.context.repo.owner} - default owner.`)
killedBy: run should use default repo and owner when inputs are not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "defaultOwner - default owner."
Received
       1: "defaultRepo - default repo."
       2: "/defaultRepo"
       3: "1 repository registered."

[Killed] EqualityOperator
src/index.ts:31:25
       .filter(x => x !== '')
 
     let owner: string = core.getInput('owner')
-    if (owner === '' || owner === null) {
+    if (owner === '' || owner !== null) {
       owner = github.context.repo.owner
       core.info(`${github.context.repo.owner} - default owner.`)
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testOwner/repo1"
Received
       1: "defaultOwner - default owner."
       2: "defaultOwner/repo1"
       3: "defaultOwner/repo2"

[Killed] BlockStatement
src/index.ts:36:44
       core.info(`${github.context.repo.owner} - default owner.`)
     }
 
-    for (const repository of repositories) {
-      core.info(`${owner}/${repository}`)
-    }
+    for (const repository of repositories) {}
 
     const repoCount = repositories.length
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testOwner/repo1"
Received: "2 repositories registered."

Number of calls: 1

[Killed] StringLiteral
src/index.ts:37:17
     }
 
     for (const repository of repositories) {
-      core.info(`${owner}/${repository}`)
+      core.info(``)
     }
 
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testOwner/repo1"
Received
       1: ""
       2: ""
       3: "2 repositories registered."

[Killed] ConditionalExpression
src/index.ts:41:9
     }
 
     const repoCount = repositories.length
-    if (repoCount > 1) {
+    if (false) {
       core.info(`${repoCount.toString()} repositories registered.`)
     } else {
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "2 repositories registered."
Received
       1: "testOwner/repo1"
       2: "testOwner/repo2"
       3: "2 repository registered."

[Killed] BlockStatement
src/index.ts:41:24
     }
 
     const repoCount = repositories.length
-    if (repoCount > 1) {
-      core.info(`${repoCount.toString()} repositories registered.`)
-    } else {
+    if (repoCount > 1) {} else {
       core.info(`${repoCount.toString()} repository registered.`)
     }
killedBy: run should handle multiple repositories correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "2 repositories registered."
Received
       1: "testOwner/repo1"
       2: "testOwner/repo2"

Number of calls: 2

[Survived] BlockStatement
src/index.ts:43:12
     const repoCount = repositories.length
     if (repoCount > 1) {
       core.info(`${repoCount.toString()} repositories registered.`)
-    } else {
-      core.info(`${repoCount.toString()} repository registered.`)
-    }
+    } else {}
 
     repo = repositories[0]

[Survived] StringLiteral
src/index.ts:44:17
     if (repoCount > 1) {
       core.info(`${repoCount.toString()} repositories registered.`)
     } else {
-      core.info(`${repoCount.toString()} repository registered.`)
+      core.info(``)
     }
 

[Survived] EqualityOperator
src/index.ts:50:9
     repo = repositories[0]
 
     let token: string | undefined = core.getInput('token')
-    if (token === '' || token === null) {
+    if (token !== '' || token === null) {
       // token = github.context.token;
       token = process.env.GH_TOKEN

[Survived] ConditionalExpression
src/index.ts:50:9
     repo = repositories[0]
 
     let token: string | undefined = core.getInput('token')
-    if (token === '' || token === null) {
+    if (true) {
       // token = github.context.token;
       token = process.env.GH_TOKEN

[Killed] StringLiteral
src/index.ts:55:55
       token = process.env.GH_TOKEN
     }
 
-    const logging: string | undefined = core.getInput('logging')
+    const logging: string | undefined = core.getInput("")
     const filtered: boolean | undefined =
       core.getInput('filtered') === 'true' ? true : false
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "deploy-rate-log", "log1
log2"
Received
       1: "deploy-rate", 5
       2: "lead-time", 10
       3: "change-failure-rate", 0.1

[Killed] ConditionalExpression
src/index.ts:57:7
 
     const logging: string | undefined = core.getInput('logging')
     const filtered: boolean | undefined =
-      core.getInput('filtered') === 'true' ? true : false
+      true ? true : false
 
     const rel = new ReleaseAdapter(token, owner, repositories)
killedBy: run should set filtered to true when 'filtered' input is 'true'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "filtered"
Received
       1: "repo"
       2: "owner"
       3: "token"

[Killed] ConditionalExpression
src/index.ts:57:7
 
     const logging: string | undefined = core.getInput('logging')
     const filtered: boolean | undefined =
-      core.getInput('filtered') === 'true' ? true : false
+      false ? true : false
 
     const rel = new ReleaseAdapter(token, owner, repositories)
killedBy: run should set filtered to true when 'filtered' input is 'true'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "filtered"
Received
       1: "repo"
       2: "owner"
       3: "token"

[Killed] BlockStatement
src/index.ts:63:29
     const releaseList = (await rel.GetAllReleasesLastMonth()) as Release[]
     const df = new DeployFrequency(releaseList)
     core.setOutput('deploy-rate', df.rate())
-    if (logging === 'true') {
-      core.setOutput('deploy-rate-log', df.getLog().join('\n'))
-    }
+    if (logging === 'true') {}
 
     const prs = new PullRequestsAdapter(token, owner, repositories)
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "deploy-rate-log", "log1
log2"
Received
       1: "deploy-rate", 5
       2: "lead-time", 10
       3: "lead-time-log", "leadTimeLog1

[Killed] EqualityOperator
src/index.ts:63:9
     const releaseList = (await rel.GetAllReleasesLastMonth()) as Release[]
     const df = new DeployFrequency(releaseList)
     core.setOutput('deploy-rate', df.rate())
-    if (logging === 'true') {
+    if (logging !== 'true') {
       core.setOutput('deploy-rate-log', df.getLog().join('\n'))
     }
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "deploy-rate-log", "log1
log2"
Received
       1: "deploy-rate", 5
       2: "lead-time", 10
       3: "lead-time-log", "leadTimeLog1

[Killed] ConditionalExpression
src/index.ts:73:9
     const lt = new LeadTime(pulls, releaseList, commits)
     const leadTime = await lt.getLeadTime(filtered)
     core.setOutput('lead-time', leadTime)
-    if (logging === 'true') {
+    if (false) {
       core.setOutput('lead-time-log', lt.getLog().join('\n'))
     }
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "lead-time-log", "leadTimeLog1
leadTimeLog2"
Received
       1: "deploy-rate", 5
       2: "deploy-rate-log", "log1
log2"

[Killed] EqualityOperator
src/index.ts:73:9
     const lt = new LeadTime(pulls, releaseList, commits)
     const leadTime = await lt.getLeadTime(filtered)
     core.setOutput('lead-time', leadTime)
-    if (logging === 'true') {
+    if (logging !== 'true') {
       core.setOutput('lead-time-log', lt.getLog().join('\n'))
     }
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "lead-time-log", "leadTimeLog1
leadTimeLog2"
Received
       1: "deploy-rate", 5
       2: "deploy-rate-log", "log1
log2"

[Killed] StringLiteral
src/index.ts:74:56
     const leadTime = await lt.getLeadTime(filtered)
     core.setOutput('lead-time', leadTime)
     if (logging === 'true') {
-      core.setOutput('lead-time-log', lt.getLog().join('\n'))
+      core.setOutput('lead-time-log', lt.getLog().join(""))
     }
 
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "lead-time-log", "leadTimeLog1
leadTimeLog2"
Received
       1: "deploy-rate", 5
       2: "deploy-rate-log", "log1
log2"

[Killed] BlockStatement
src/index.ts:80:20
     const issueAdapter = new IssuesAdapter(token, owner, repositories)
     const issueList: Issue[] | undefined =
       await issueAdapter.GetAllIssuesLastMonth()
-    if (issueList) {
-      const cfr = new ChangeFailureRate(issueList, releaseList)
-      core.setOutput('change-failure-rate', cfr.Cfr())
-      const mttr = new MeanTimeToRestore(issueList, releaseList)
-      core.setOutput('mttr', mttr.mttr())
-    } else {
+    if (issueList) {} else {
       core.setOutput('change-failure-rate', 'empty issue list')
       core.setOutput('mttr', 'empty issue list')
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "change-failure-rate", 0.1
Received
       1: "deploy-rate", 5
       2: "deploy-rate-log", "log1
log2"
       3: "lead-time", 10

[Killed] StringLiteral
src/index.ts:82:22
       await issueAdapter.GetAllIssuesLastMonth()
     if (issueList) {
       const cfr = new ChangeFailureRate(issueList, releaseList)
-      core.setOutput('change-failure-rate', cfr.Cfr())
+      core.setOutput("", cfr.Cfr())
       const mttr = new MeanTimeToRestore(issueList, releaseList)
       core.setOutput('mttr', mttr.mttr())
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "change-failure-rate", 0.1
Received
       1: "deploy-rate", 5
       2: "deploy-rate-log", "log1
log2"
       3: "lead-time", 10

[Killed] BlockStatement
src/index.ts:85:12
       core.setOutput('change-failure-rate', cfr.Cfr())
       const mttr = new MeanTimeToRestore(issueList, releaseList)
       core.setOutput('mttr', mttr.mttr())
-    } else {
-      core.setOutput('change-failure-rate', 'empty issue list')
-      core.setOutput('mttr', 'empty issue list')
-    }
+    } else {}
   } catch (error: any) {
     core.setFailed(error.message)
killedBy: run should handle empty issue list case
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "change-failure-rate", "empty issue list"
Received
       1: "deploy-rate", undefined
       2: "lead-time", undefined

Number of calls: 2

[Killed] BlockStatement
src/index.ts:89:24
       core.setOutput('change-failure-rate', 'empty issue list')
       core.setOutput('mttr', 'empty issue list')
     }
-  } catch (error: any) {
-    core.setFailed(error.message)
-  }
+  } catch (error: any) {}
 }
 
killedBy: run should handle errors and set failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to fetch releases"

Number of calls: 0
